app/controllers/movies_controller.rb

  def index
		#debugger
		if session.include?(:params)
			unless session[:params].eql? params
				params.each_key do |p|
					unless session[:params][p] == params[p]
						session[:params][p] = params[p]
					end
				end
				#debugger
				flash.keep
				redirect_to movies_path(session[:params])
			end
		else
			session[:params] = params
		end


		@all_ratings = Movie.pluck(:rating).uniq.sort
		if params[:ratings].blank?
			@checked_ratings = @all_ratings
		else
			@checked_ratings = params[:ratings].keys
		end
		@sort = params[:sort]
		if params[:sort] == 'title'
			@movies = Movie.order('title').find_all_by_rating(@checked_ratings)
		elsif params[:sort] == 'release_date'
			@movies = Movie.order('release_date').find_all_by_rating(@checked_ratings)
		else
			@movies = Movie.find_all_by_rating(@checked_ratings)
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')